## Introduction to <span style="color: green;">Pandas</span>

**Pandas** is a powerful Python library for data manipulation and analysis. It provides high-performance data structures and data analysis tools that make working with structured data easy and efficient.

**Pandas Provides two types of classes for handling data:**

* **Series:**
    * A one-dimensional labeled array capable of holding any data type (integers, floats, strings, objects, etc.).
    * Each element in a Series is associated with a label, which can be any immutable object (e.g., strings, integers, or tuples).
    * Series objects are often created from Python lists or NumPy arrays.
* **DataFrame:**
    * A two-dimensional labeled data structure with rows and columns.
    * Each column in a DataFrame is a Series object, and each row is a dictionary-like object.
    * DataFrames can be created from various sources, such as Python dictionaries, lists of lists, or NumPy arrays.

**Installation Process:**

* **Using pip:** pip install pandas
* **Using conda:** conda install pandas

* For more help with installation: https://pandas.pydata.org/docs/getting_started/install.html

<span style="color: orange;">Lets begin with practice</span>
* Leetcode Practice Link: https://leetcode.com/studyplan/introduction-to-pandas/

***

### Q1 Create a Database from List                                                                                
### Difficulty: <span style="color: red;">Easy</span>
Write a solution to create a DataFrame from a 2D list called <span style="color: green;">student_data</span>. This 2D list contains the IDs and ages of some students.
The DataFrame should have two columns, <span style="color: green;">student_id</span> and <span style="color: green;">age</span>, and be in the same order as the original 2D list.
The result format is in the following example.

**Example Input:**

```python
student_data = [
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]

**Output:**

| student_id | age |
|---|---|
| 1 | 15 |
| 2 | 11 |
| 3 | 11 |
| 4 | 20 |


Explanation: A DataFrame was created on top of student_data, with two columns named <span style="color: green;">student_id</span> and <span style="color: green;">age</span>.

In [2]:
#Solution
import pandas as pd
student_data=[[1, 15], [2, 11], [3, 11], [4, 20]]
df=pd.DataFrame(student_data, columns=['student_id', 'age'])
print(df.head())

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

***

### Q2 Get the Size of a DataFrame                                                                               
### Difficulty: <span style="color: red;">Easy</span>

* DataFrame <span style="color: green;">players</span>

| Column Name | Type |
|---|---|
| player_id | int |
| name | object |
| age | int |
| position | object |
| ... | ... |

Write a solution to calculate and display the number of rows and columns of <span style="color: green;">players</span>.<br>
Return the result as an array:<br>
<span style="color: green;">[number of rows, number of columns]</span>

**Example Input:**

| player_id | name     | age | position    | team               |
|-----------|----------|-----|-------------|--------------------|
| 846       | Mason    | 21  | Forward     | RealMadrid         |
| 749       | Riley    | 30  | Winger      | Barcelona          |
| 155       | Bob      | 28  | Striker     | ManchesterUnited   |
| 583       | Isabella | 32  | Goalkeeper  | Liverpool          |
| 388       | Zachary  | 24  | Midfielder  | BayernMunich       |
| 883       | Ava      | 23  | Defender    | Chelsea            |
| 355       | Violet   | 18  | Striker     | Juventus           |
| 247       | Thomas   | 27  | Striker     | ParisSaint-Germain |
| 761       | Jack     | 33  | Midfielder  | ManchesterCity     |
| 642       | Charlie  | 36  | Center-back | Arsenal            |

**Output:**
[10, 5]

**Explanation:**
This DataFrame contains 10 rows and 5 columns.

In [10]:
#Solution
import pandas as pd
players=[
    ["player_id", "name", "age", "position", "team"],
    [846, "Mason", 21, "Forward", "RealMadrid"],
    [749, "Riley", 30, "Winger", "Barcelona"],
    [155, "Bob", 28, "Striker", "ManchesterUnited"],
    [583, "Isabella", 32, "Goalkeeper", "Liverpool"],
    [388, "Zachary", 24, "Midfielder", "BayernMunich"],
    [883, "Ava", 23, "Defender", "Chelsea"],
    [355, "Violet", 18, "Striker", "Juventus"],
    [247, "Thomas", 27, "Striker", "ParisSaint-Germain"],
    [761, "Jack", 33, "Midfielder", "ManchesterCity"],
    [642, "Charlie", 36, "Center-back", "Arsenal"]
]

df=pd.DataFrame(players[1:], columns=players[0]) #Here we used slicing so that the first row is considered as the column headers and every row from index 1 is our actual data
print(df.head())

   player_id      name  age    position              team
0        846     Mason   21     Forward        RealMadrid
1        749     Riley   30      Winger         Barcelona
2        155       Bob   28     Striker  ManchesterUnited
3        583  Isabella   32  Goalkeeper         Liverpool
4        388   Zachary   24  Midfielder      BayernMunich

In [12]:
print(list(df.shape))  #We needed our output as a list and df.shape gives us the output as a tuple which is why we used the list method to convert this tuple to list

[10, 5]

***

### Q3 Display the First Three Rows
### Difficulty: <span style="color: red;">Easy</span>
Write a solution to display the first <span style="color: green;">3</span> rows of this DataFrame.

**Example Input:**
* DataFrame: <span style="color: green;">employees</span>

| employee_id | name      | department            | salary |
| ----------- | --------- | --------------------- | ------ |
| 3           | Bob       | Operations            | 48675  |
| 90          | Alice     | Sales                 | 11096  |
| 9           | Tatiana   | Engineering           | 33805  |
| 60          | Annabelle | InformationTechnology | 37678  |
| 49          | Jonathan  | HumanResources        | 23793  |
| 43          | Khaled    | Administration        | 40454  |

**Output:**
| employee_id | name      | department            | salary |
| ----------- | --------- | --------------------- | ------ |
| 3           | Bob       | Operations            | 48675  |
| 90          | Alice     | Sales                 | 11096  |
| 9           | Tatiana   | Engineering           | 33805  |

**Explanation:**
Only the first 3 rows are displayed.

In [7]:
#Solution
import pandas as pd
employees=[
    ["employee_id", "name", "department", "salary"],
    [3, "Bob", "Operations", 48675],
    [90, "Alice", "Sales", 11096],
    [9, "Tatiana", "Engineering", 33805],
    [60, "Annabelle", "InformationTechnology", 37678],
    [49, "Jonathan", "HumanResources", 23793],
    [43, "Khaled", "Administration", 40454]
]
df=pd.DataFrame(employees[1:], columns=employees[0])
print(df.head())

   employee_id       name             department  salary
0            3        Bob             Operations   48675
1           90      Alice                  Sales   11096
2            9    Tatiana            Engineering   33805
3           60  Annabelle  InformationTechnology   37678
4           49   Jonathan         HumanResources   23793

In [5]:
#To print the first particular number of rows, simply define the head argument with the nth element (in our case 3)
df.head(3)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

***

### Q4 Select Data
### Difficulty: <span style="color: red;">Easy</span>
Write a solution to select the name and age of the student with <span style="color: green;">student_id = 101</span>.

* DataFrame <span style="color: green;">students</span>

| Column Name | Type |
|---|---|
| student_id | int |
| name | object |
| age | int |

**Example Input:**

| student_id | name    | age |
| ---------- | ------- | --- |
| 101        | Ulysses | 13  |
| 53         | William | 10  |
| 128        | Henry   | 6   |
| 3          | Henry   | 11  |

**Output:**

| name    | age |
| ------- | --- |
| Ulysses | 13  |

**Explaination:**
Student Ulysses has student_id = 101, we select the name and age.

In [9]:
#Solution
import pandas as pd
students=[
    ["student_id", "name", "age"],
    [101, "Ulysses", 13],
    [53, "William", 10],
    [128, "Henry", 6],
    [3, "Henry", 11]
]
df=pd.DataFrame(students[1:], columns=students[0])
print(df.head())

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

In [43]:
# We use .iloc which helps up in slicing the DataFrame based on rows and columns, the first parameter for iloc is for rows while the second is for column.
# ":" A semicolon means selecting every row in the first parameter and for column we needed columns name and age which are at index 1 and 2 respectively so
# the second parameter we start slicing from index 1 till the end
print(df[df["student_id"]==101].iloc[:,1:])

      name  age
0  Ulysses   13

***

### Q5 Create a New Column
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">employees</span>

| Column Name | Type |
|---|---|
| name | object |
| salary | int |

A company plans to provide its employees with a bonus.<br>
Write a solution to create a new column name <span style="color: green;">bonus</span> that contains the <strong>doubled values</strong> of the <span style="color: green;">salary</span> column.

**Example Input:**
| name    | salary |
| ------- | ------ |
| Piper   | 4548   |
| Grace   | 28150  |
| Georgia | 1103   |
| Willow  | 6593   |
| Finn    | 74576  |
| Thomas  | 24433  |

**Output:**
| name    | salary | bonus |
| ------- | ------ | ------- |
| Piper   | 4548   | 9096 |
| Grace   | 28150  | 56300 |
| Georgia | 1103   | 2206 |
| Willow  | 6593   | 13186 |
| Finn    | 74576  | 149152 |
| Thomas  | 24433  | 48866 |

**Explanation:**
A new column bonus is created by doubling the value in the column salary.

In [44]:
#Solution
import pandas as pd
employees=[
    ["name", "salary"],
    ["Piper", 4548],
    ["Grace", 28150],
    ["Georgia", 1103],
    ["Willow", 6593],
    ["Finn", 74576],
    ["Thomas", 24433]
]
df=pd.DataFrame(employees[1:], columns=employees[0])
print(df.head())

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576

In [45]:
df["bonus"]=df["salary"]*2 #We simply initiate a new value and its value to double of salary column.
print(df.head())

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152

***

### Q6 Drop Duplicate Columns
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">customers</span>

| Column Name | Type |
|---|---|
| customer_id | int |
| name | object |
| email | object |

There are some duplicate rows in the DataFrame based on the <span style="color: green;">email</span> column.<br>
Write a solution to remove these duplicate rows and keep only the <strong>first</strong> occurrence.<br>
The result format is in the following example.

**Example Input:**
| customer_id | name    | email               |
| ----------- | ------- | ------------------- |
| 1           | Ella    | emily@example.com   |
| 2           | David   | michael@example.com |
| 3           | Zachary | sarah@example.com   |
| 4           | Alice   | john@example.com    |
| 5           | Finn    | john@example.com    |
| 6           | Violet  | alice@example.com   |

**Output:**
| customer_id | name    | email               |
| ----------- | ------- | ------------------- |
| 1           | Ella    | emily@example.com   |
| 2           | David   | michael@example.com |
| 3           | Zachary | sarah@example.com   |
| 4           | Alice   | john@example.com    |
| 6           | Violet  | alice@example.com   |

**Explanation:**
Alic (customer_id = 4) and Finn (customer_id = 5) both use john@example.com, so only the first occurrence of this email is retained.

In [59]:
#Solution
import pandas as pd
customers=[
    ["customer_id", "name", "email"],
    [1, "Ella", "emily@example.com"],
    [2, "David", "michael@example.com"],
    [3, "Zachary", "sarah@example.com"],
    [4, "Alice", "john@example.com"],
    [5, "Finn", "john@example.com"],
    [6, "Violet", "alice@example.com"]
]
df=pd.DataFrame(customers[1:], columns=customers[0])
print(df.head())

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com

In [60]:
df_unique=df.drop_duplicates("email", keep='first')
print(df_unique)

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

***

### Q7 Drop Missing Data
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">students</span>

| Column Name | Type |
|---|---|
| student_id | int |
| name | object |
| age | int |

There are some rows having missing values in the <span style="color: green;">name</span> column.<br>
Write a solution to remove the rows with missing values.<br>

**Example Input:**
| student_id | name    | age |
| ---------- | ------- | --- |
| 32         | Piper   | 5   |
| 217        | null    | 19  |
| 779        | Georgia | 20  |
| 849        | Willow  | 14  |

**Output:**
| student_id | name    | age |
| ---------- | ------- | --- |
| 32         | Piper   | 5   |
| 779        | Georgia | 20  |
| 849        | Willow  | 14  |

**Explanation:**
Student with id 217 havs empty value in the name column, so it will be removed.

In [12]:
#Solution
import pandas as pd
students=data = [
    ["student_id", "name", "age"],
    [32, "Piper", 5],
    [217, None, 19],
    [779, "Georgia", 20],
    [849, "Willow", 14]
]
df=pd.DataFrame(students[1:], columns=students[0])
print(df.head())

   student_id     name  age
0          32    Piper    5
1         217     None   19
2         779  Georgia   20
3         849   Willow   14

In [6]:
df_cleaned=df.dropna(subset="name", inplace=False)
print(df_cleaned)

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

***

### Q8 Modify Columns
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">employees</span>

| Column Name | Type |
|---|---|
| name | object |
| salary | int |

A company intends to give its employees a pay rise.<br>
Write a solution to <strong>modify</strong> the <span style="color: green;">salary</span> column by multiplying each salary by 2.<br>

**Example Input:**
| name    | salary |
| ------- | ------ |
| Jack    | 19666  |
| Piper   | 74754  |
| Mia     | 62509  |
| Ulysses | 54866  |

**Output:**
| name    | salary |
| ------- | ------- |
| Jack    | 39332  |
| Piper   | 149508  |
| Mia     | 125018  |
| Ulysses | 109732  |

**Explanation:**
Every salary has been doubled.

In [14]:
#Solution
import pandas as pd
employees=[
    ["name", "salary"],
    ["Jack", 19666],
    ["Piper", 74754],
    ["Mia", 62509],
    ["Ulysses", 54866]
]
df=pd.DataFrame(employees[1:], columns=employees[0])
print(df.head())

      name  salary
0     Jack   19666
1    Piper   74754
2      Mia   62509
3  Ulysses   54866

In [15]:
df["salary"]=df["salary"]*2
print(df)

      name  salary
0     Jack   39332
1    Piper  149508
2      Mia  125018
3  Ulysses  109732

***

### Q9 Rename Columns
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">students</span>

| Column Name | Type |
|---|---|
| id | int |
| first | object |
| last | object |
| age | int |

Write a solution to rename the columns as follows:
* id to student_id
* first to first_name
* last to last_name
* age to age_in_years

**Example Input:**
| id | first   | last     | age |
| -- | ------- | -------- | --- |
| 1  | Mason   | King     | 6   |
| 2  | Ava     | Wright   | 7   |
| 3  | Taylor  | Hall     | 16  |
| 4  | Georgia | Thompson | 18  |
| 5  | Thomas  | Moore    | 10  |

**Output:**
| student_id | first_name | last_name | age_in_years |
| -- | ------- | -------- | --- |
| 1  | Mason   | King     | 6   |
| 2  | Ava     | Wright   | 7   |
| 3  | Taylor  | Hall     | 16  |
| 4  | Georgia | Thompson | 18  |
| 5  | Thomas  | Moore    | 10  |

**Explanation:**
The column names are changed accordingly.

In [4]:
#Solution
import pandas as pd
students=[
    ["id", "first", "last", "age"],
    [1, "Mason", "King", 6],
    [2, "Ava", "Wright", 7],
    [3, "Taylor", "Hall", 16],
    [4, "Georgia", "Thompson", 18],
    [5, "Thomas", "Moore", 10]
]
df=pd.DataFrame(students[1:], columns=students[0])
print(df.head())

   id    first      last  age
0   1    Mason      King    6
1   2      Ava    Wright    7
2   3   Taylor      Hall   16
3   4  Georgia  Thompson   18
4   5   Thomas     Moore   10

In [5]:
df.rename(columns={
    "id":"student_id", 
    "first":"first_name", 
    "last":"last_name", 
    "age":"age_in_years"
}, inplace=True)
print(df)

   student_id first_name last_name  age_in_years
0           1      Mason      King             6
1           2        Ava    Wright             7
2           3     Taylor      Hall            16
3           4    Georgia  Thompson            18
4           5     Thomas     Moore            10

***

### Q10 Change Data Type
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">students</span>

| Column Name | Type |
|---|---|
| student_id | int |
| name | object |
| age | int |
| grade | float |

Write a solution to correct the errors:<br>
The <span style="color: green;">grade</span> column is stored as floats, convert it to integers.<br>

**Example Input:**
| student_id | name | age | grade |
| ---------- | ---- | --- | ----- |
| 1          | Ava  | 6   | 73.0  |
| 2          | Kate | 15  | 87.0  |

**Output:**
| student_id | name | age | grade |
| ---------- | ---- | --- | ----- |
| 1          | Ava  | 6   | 73    |
| 2          | Kate | 15  | 87    |

**Explanation:**
The data types of the column grade is converted to int.

In [7]:
#Solution
import pandas as pd
students=[
    ["student_id", "name", "age", "grade"],
    [1, "Ava", 6, 73.0],  # Grade stored as a float
    [2, "Kate", 15, 87.0]  # Grade stored as a float
]
df=pd.DataFrame(students[1:], columns=students[0])
print(df.head())

   student_id  name  age  grade
0           1   Ava    6   73.0
1           2  Kate   15   87.0

In [11]:
df["grade"]=df["grade"].astype(int)
print(type(df["grade"][0])) #This will show us the data type of the values in column grade.
print("\n")
print(df)

<class 'numpy.int32'>


   student_id  name  age  grade
0           1   Ava    6     73
1           2  Kate   15     87

***

### Q11 Fill Missing Data
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">products</span>

| Column Name | Type |
|---|---|
| name | object |
| quantity | int |
| price | int |

Write a solution to fill in the missing value as <span style="color: green;">0</span> in the <span style="color: green;">quantity</span> column.

**Example Input:**
| name            | quantity | price |
| --------------- | -------- | ----- |
| Wristwatch      | null     | 135   |
| WirelessEarbuds | null     | 821   |
| GolfClubs       | 779      | 9319  |
| Printer         | 849      | 3051  |

**Output:**
| name            | quantity | price |
| --------------- | -------- | ----- |
| Wristwatch      | 0        | 135   |
| WirelessEarbuds | 0        | 821   |
| GolfClubs       | 779      | 9319  |
| Printer         | 849      | 3051  |

**Explanation:**
The quantity for Wristwatch and WirelessEarbuds are filled by 0.

In [23]:
#Solution
import pandas as pd
products=[
    ["name", "quantity", "price"],
    ["Wristwatch", None, 135],
    ["WirelessEarbuds", None, 821],
    ["GolfClubs", 779, 9319],
    ["Printer", 849, 3051]
]
df=pd.DataFrame(products[1:], columns=products[0])
print(df.head())

              name  quantity  price
0       Wristwatch       NaN    135
1  WirelessEarbuds       NaN    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

In [24]:
df["quantity"]=df["quantity"].fillna(0)
print(df)

              name  quantity  price
0       Wristwatch       0.0    135
1  WirelessEarbuds       0.0    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

***

### Q12 Reshape Data: Concatenate
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">df1</span>

| Column Name | Type |
|---|---|
| student_id | int |
| name | object |
| age | int |

* DataFrame <span style="color: green;">df2</span>

| Column Name | Type |
|---|---|
| student_id | int |
| name | object |
| age | int |

Write a solution to concatenate these two DataFrames <strong>vertically</strong> into one DataFrame.

**Example Input:**
* df1

| student_id | name    | age |
| ---------- | ------- | --- |
| 1          | Mason   | 8   |
| 2          | Ava     | 6   |
| 3          | Taylor  | 15  |
| 4          | Georgia | 17  |

* df2

| student_id | name | age |
| ---------- | ---- | --- |
| 5          | Leo  | 7   |
| 6          | Alex | 7   |

**Output:**
| student_id | name    | age |
| ---------- | ------- | --- |
| 1          | Mason   | 8   |
| 2          | Ava     | 6   |
| 3          | Taylor  | 15  |
| 4          | Georgia | 17  |
| 5          | Leo     | 7   |
| 6          | Alex    | 7   |

**Explanation:**
The two DataFramess are stacked vertically, and their rows are combined.

In [31]:
#Solution
import pandas as pd
table1=[
    ["student_id", "name", "age"],
    [1, "Mason", 8],
    [2, "Ava", 6],
    [3, "Taylor", 15],
    [4, "Georgia", 17]
]

df1=pd.DataFrame(table1[1:], columns=table1[0])

table2=[
    ["student_id", "name", "age"],
    [5, "Leo", 7],
    [6, "Alex", 7]
]

df2=pd.DataFrame(table2[1:], columns=table2[0])

print(f"df1:\n{df1}\n\ndf2:\n{df2}")

df1:
   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17

df2:
   student_id  name  age
0           5   Leo    7
1           6  Alex    7

In [33]:
final_df=pd.concat([df1, df2], ignore_index=True)
print(final_df)

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
4           5      Leo    7
5           6     Alex    7

***

### Q13 Reshape Data: Pivot
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">weather</span>

| Column Name | Type |
|---|---|
| city | object |
| month | object |
| temperature | int |

Write a solution to <strong>pivot</strong> the data so that each row represents temperatures for a specific month, and each city is a separate column.

**Example Input:**
| city         | month    | temperature |
| ------------ | -------- | ----------- |
| Jacksonville | January  | 13          |
| Jacksonville | February | 23          |
| Jacksonville | March    | 38          |
| Jacksonville | April    | 5           |
| Jacksonville | May      | 34          |
| ElPaso       | January  | 20          |
| ElPaso       | February | 6           |
| ElPaso       | March    | 26          |
| ElPaso       | April    | 2           |
| ElPaso       | May      | 43          |

**Output:**
| month    | ElPaso | Jacksonville |
|----------|--------|--------------|
| April    | 2      | 5            |
| February | 6      | 23           |
| January  | 20     | 13           |
| March    | 26     | 38           |
| May      | 43     | 34           |

**Explanation:**
The table is pivoted, each column represents a city, and each row represents a specific month.

In [17]:
#Solution
import pandas as pd
weather=[
    ["city", "month", "temperature"],
    ["Jacksonville", "January", 13],
    ["Jacksonville", "February", 23],
    ["Jacksonville", "March", 38],
    ["Jacksonville", "April", 5],
    ["Jacksonville", "May", 34],
    ["ElPaso", "January", 20],
    ["ElPaso", "February", 6],
    ["ElPaso", "March", 26],
    ["ElPaso", "April", 2],
    ["ElPaso", "May", 43]
]
df=pd.DataFrame(weather[1:], columns=weather[0])
print(df.head())

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34

In [37]:
df_pivot=df.pivot(index="month", columns="city", values="temperature").reset_index()
print(df_pivot)

city     month  ElPaso  Jacksonville
0        April       2             5
1     February       6            23
2      January      20            13
3        March      26            38
4          May      43            34

***

### Q14 Reshape Data: Melt
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">report</span>

| Column Name | Type |
|---|---|
| product | object |
| quarter_1 | int |
| quarter_2 | int |
| quarter_3 | int |
| quarter_4 | int |

Write a solution to <strong>reshape</strong> the data so that each row represents sales data for a product in a specific quarter.

**Example Input:**
| product     | quarter_1 | quarter_2 | quarter_3 | quarter_4 |
| ----------- | --------- | --------- | --------- | --------- |
| Umbrella    | 417       | 224       | 379       | 611       |
| SleepingBag | 800       | 936       | 93        | 875       |

**Output:**
| product     | quarter   | sales |
|-------------|-----------|-------|
| Umbrella    | quarter_1 | 417   |
| SleepingBag | quarter_1 | 800   |
| Umbrella    | quarter_2 | 224   |
| SleepingBag | quarter_2 | 936   |
| Umbrella    | quarter_3 | 379   |
| SleepingBag | quarter_3 | 93    |
| Umbrella    | quarter_4 | 611   |
| SleepingBag | quarter_4 | 875   |

**Explanation:**
The DataFrame is reshaped from wide to long format. Each row represents the sales of a product in a quarter.

In [39]:
#Solution
import pandas as pd
report=[
    ["product", "quarter_1", "quarter_2", "quarter_3", "quarter_4"],
    ["Umbrella", 417, 224, 379, 611],
    ["SleepingBag", 800, 936, 93, 875]
]
df=pd.DataFrame(report[1:], columns=report[0])
print(df.head())

       product  quarter_1  quarter_2  quarter_3  quarter_4
0     Umbrella        417        224        379        611
1  SleepingBag        800        936         93        875

In [40]:
df_long=df.melt(id_vars="product", var_name="quarter", value_name="sales")
print(df_long)

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

***

### Q15 Method Chaining
### Difficulty: <span style="color: red;">Easy</span>
* DataFrame <span style="color: green;">animals</span>

| Column Name | Type |
|---|---|
| name | object |
| species | object |
| age | int |
| weight | int |

Write a solution to list the names of animals that weigh <strong>strictly more than</strong> <span style="color: green;">100</span> kilograms.<br>
Return the animals sorted by weight in <strong>descending order</strong>.

**Example Input:**
| name     | species | age | weight |
| -------- | ------- | --- | ------ |
| Tatiana  | Snake   | 98  | 464    |
| Khaled   | Giraffe | 50  | 41     |
| Alex     | Leopard | 6   | 328    |
| Jonathan | Monkey  | 45  | 463    |
| Stefan   | Bear    | 100 | 50     |
| Tommy    | Panda   | 26  | 349    |

**Output:**
| name     |
|----------|
| Tatiana  |
| Jonathan |
| Tommy    |
| Alex     |

**Explanation:**<br>
All animals weighing more than 100 should be included in the results table.<br>
Tatiana's weight is 464, Jonathan's weight is 463, Tommy's weight is 349, and Alex's weight is 328.<br>
The results should be sorted in descending order of weight.

In [71]:
#Solution
import pandas as pd
animals=[
    ["name", "species", "age", "weight"],
    ["Tatiana", "Snake", 98, 464],
    ["Khaled", "Giraffe", 50, 41],
    ["Alex", "Leopard", 6, 328],
    ["Jonathan", "Monkey", 45, 463],
    ["Stefan", "Bear", 100, 50],
    ["Tommy", "Panda", 26, 349]
]
df=pd.DataFrame(animals[1:], columns=animals[0])
print(df.head())

       name  species  age  weight
0   Tatiana    Snake   98     464
1    Khaled  Giraffe   50      41
2      Alex  Leopard    6     328
3  Jonathan   Monkey   45     463
4    Stefan     Bear  100      50

In [76]:
# We will first filter them based on the weight condition and then sort them in descending order using sort_values method.
df_final=df[df["weight"]>100].sort_values(by="weight", ascending=False)[["name"]]
print(df_final)

       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex

***

<center><h1> Thank You </h1></center>